# Напишите программу, которая принимает два списка и выводит все элементы первого, которых нет во втором.

lst_1 = [1, 2, 3, 4, 5, 6]
lst_2 = [1, 2, 3, 4]

print(set(lst_1) - set(lst_2))




