# Выведите первый и последний элемент списка.


def first_and_last(lst):
    return lst[0], lst[-1]


print(first_and_last([1, 5, 6, 4, 8]))
